## Pandas Day-4

## Pandas DataFrame Operations

In [1]:
import pandas as pd

In [2]:
# Creating DataFrame
data = {
    "Name": ["Amit", "Rahul", "Neha", "Priya"],
    "Age": [21, 22, 20, 23],
    "Marks": [85, 78, 90, 88]
}

df = pd.DataFrame(data)
df

    Name  Age  Marks
0   Amit   21     85
1  Rahul   22     78
2   Neha   20     90
3  Priya   23     88

### Checking Data

In [3]:
df.head()

    Name  Age  Marks
0   Amit   21     85
1  Rahul   22     78
2   Neha   20     90
3  Priya   23     88

In [4]:
df.tail()

    Name  Age  Marks
0   Amit   21     85
1  Rahul   22     78
2   Neha   20     90
3  Priya   23     88

In [5]:
df.shape

(4, 3)

### Column Operations

In [6]:
df["Age"]

0    21
1    22
2    20
3    23
Name: Age, dtype: int64

In [7]:
df[["Name", "Marks"]]

    Name  Marks
0   Amit     85
1  Rahul     78
2   Neha     90
3  Priya     88

### Adding a New Column

In [8]:
df["Passed"] = df["Marks"] >= 80
df

    Name  Age  Marks  Passed
0   Amit   21     85    True
1  Rahul   22     78   False
2   Neha   20     90    True
3  Priya   23     88    True

### Basic Calculations

In [9]:
df["Marks"].mean()

85.25

In [10]:
df["Marks"].max()

90

In [11]:
df["Marks"].min()

78

### Filtering Data

In [12]:
df[df["Marks"] > 80]

    Name  Age  Marks  Passed
0   Amit   21     85    True
2   Neha   20     90    True
3  Priya   23     88    True

### Conclusion
This notebook covers basic DataFrame operations such as selection, filtering, and simple calculations.